# OutsideDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..OutsideDiameter Property
PipePressureDropData Class See Also
---
The outside diameter of the pipe. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double OutsideDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OutsideDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double OutsideDiameter {
	double get ();
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace